app/Controllers/Login.php

    public function auth()
    {
        $session = session();
        $model = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $data = $model->where('user_email', $email)->first();
---
SELECT *
FROM `users`
WHERE `user_email` = 'sitiardila611@gmail.com'
 LIMIT 1